### Import the necessary libraries

In [4]:
import pandas as pd
import sqlalchemy as alch

In [15]:
# !pip install sqlalchemy
#!pip install pymysql
# !pip install --upgrade SQLAlchemy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: SQLAlchemy in c:\program files\anaconda3\lib\site-packages (1.1.9)
Collecting SQLAlchemy
  Downloading SQLAlchemy-1.4.6-cp36-cp36m-win_amd64.whl (1.5 MB)
Requirement already satisfied: greenlet!=0.4.17 in c:\program files\anaconda3\lib\site-packages (from SQLAlchemy) (0.4.12)
Collecting importlib-metadata
  Downloading importlib_metadata-3.10.0-py3-none-any.whl (14 kB)
Collecting typing-extensions>=3.6.4
  Downloading typing_extensions-3.7.4.3-py3-none-any.whl (22 kB)
Collecting zipp>=0.5
  Downloading zipp-3.4.1-py3-none-any.whl (5.2 kB)
Installing collected packages: zipp, typing-extensions, importlib-metadata, SQLAlchemy
Successfully installed SQLAlchemy-1.4.6 importlib-metadata-3.10.0 typing-extensions-3.7.4.3 zipp-3.4.1

WARNING: pip is being invoked by an old script wrapper. This will fail in a future version of pip.
Please see https://github.com/pypa/pip/issues/5599 for advice on fixing the underlying issue.
To avoid this problem you can invoke Python with '-m pip' instead of running pip directly.

### Store your username and password for the database
You can choose to do this with getpass or with an environment variable.

In [16]:
from getpass import getpass

In [17]:
user = input("Introduce tu user de sql: ")

Introduce tu user de sql: root

In [18]:
password = getpass("Introduce tu pass de sql: ")

Introduce tu pass de sql: ········

### Establishes the connection to the database

In [20]:
dbName="publications"
connectionData=f"mysql+pymysql://{user}:{password}@localhost/{dbName}"

#connectionData=f"mysql+pymysql://{user}:{password}@localhost/{dbName}"

### Remember to create the engine

In [21]:
engine = alch.create_engine(connectionData)
print("Connected to server!")

Connected to server!

In [25]:
engine.connect()

In [19]:
print(user, password)

root adminadmin

## Challenge 1 - Who Have Published What At Where?
In this challenge you will write a MySQL `SELECT` query that joins various tables to figure out what titles each author has published at which publishers. Your output should have at least the following columns:

* `AUTHOR ID` - the ID of the author
* `LAST NAME` - author last name
* `FIRST NAME` - author first name
* `TITLE` - name of the published title
* `PUBLISHER` - name of the publisher where the title was published

In [29]:
df = pd.read_sql_query(
"""
SELECT a.au_id AS 'AUTHOR ID',a.au_lname AS 'LAST NAME',a.au_fname AS 'FIRST NAME',t.title AS TITLE,p.pub_name AS PUBLISHER
FROM authors AS a
INNER JOIN titleauthor AS ta ON a.au_id=ta.au_id
INNER JOIN titles AS t ON ta.title_id=t.title_id
INNER JOIN publishers AS p ON t.pub_id=p.pub_id;

""", engine
)

In [27]:
df.head()

,AUTHOR ID,LAST NAME,FIRST NAME,TITLE,PUBLISHER
0,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
1,409-56-7008,Bennet,Abraham,The Busy Executive's Database Guide,Algodata Infosystems
2,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
3,724-80-9391,MacFeather,Stearns,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems
4,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books

## Challenge 2 - Who Have Published How Many At Where?
More info in the readme.md

In [30]:
df = pd.read_sql_query(
"""
SELECT a.au_id AS 'AUTHOR ID',a.au_lname AS 'LAST NAME',a.au_fname AS 'FIRST NAME',p.pub_name AS PUBLISHER, COUNT(t.title_id) AS 'TOTAL'
FROM authors AS a
INNER JOIN titleauthor AS ta ON a.au_id=ta.au_id
INNER JOIN titles AS t ON ta.title_id=t.title_id
INNER JOIN publishers AS p ON t.pub_id=p.pub_id
GROUP BY a.au_id, p.pub_name;

""", engine
)

In [31]:
df.head()

     AUTHOR ID LAST NAME FIRST NAME       PUBLISHER  TOTAL
0  213-46-8915     Green   Marjorie  New Moon Books      1
1  899-46-2035    Ringer       Anne  New Moon Books      1
2  998-72-3567    Ringer     Albert  New Moon Books      2
3  172-32-1176     White    Johnson  New Moon Books      1
4  486-29-1786  Locksley   Charlene  New Moon Books      1

## Challenge 3 - Best Selling Authors
More info in the readme.md

In [39]:
df = pd.read_sql_query(
"""
SELECT a.au_id AS 'AUTHOR ID',a.au_lname AS 'LAST NAME',a.au_fname AS 'FIRST NAME',SUM(s.qty) AS TOTAL
FROM authors AS a
INNER JOIN titleauthor AS ta ON a.au_id=ta.au_id
INNER JOIN titles AS t ON ta.title_id=t.title_id
INNER JOIN sales AS s ON t.title_id=t.title_id
GROUP BY a.au_id
ORDER BY SUM(qty) DESC
LIMIT 3;

""", engine
)

In [40]:
df.head()

     AUTHOR ID LAST NAME FIRST NAME  TOTAL
0  486-29-1786  Locksley   Charlene  986.0
1  998-72-3567    Ringer     Albert  986.0
2  267-41-2394   O'Leary    Michael  986.0

## Challenge 4 - Best Selling Authors Ranking
More info in the readme.md

In [34]:
df = pd.read_sql_query(
"""
SELECT a.au_id AS 'AUTHOR ID',a.au_lname AS 'LAST NAME',a.au_fname AS 'FIRST NAME',IFNULL(SUM(s.qty),0) AS 'TOTAL'
FROM authors AS a
LEFT JOIN titleauthor AS ta ON a.au_id=ta.au_id
LEFT JOIN titles AS t ON ta.title_id=t.title_id
LEFT JOIN sales AS s ON t.title_id=t.title_id
GROUP BY a.au_id
ORDER BY SUM(qty) DESC;

""", engine
)

In [36]:
df.head(25)

      AUTHOR ID       LAST NAME   FIRST NAME  TOTAL
0   213-46-8915           Green     Marjorie  986.0
1   267-41-2394         O'Leary      Michael  986.0
2   486-29-1786        Locksley     Charlene  986.0
3   724-80-9391      MacFeather      Stearns  986.0
4   899-46-2035          Ringer         Anne  986.0
5   998-72-3567          Ringer       Albert  986.0
6   172-32-1176           White      Johnson  493.0
7   238-95-7766          Carson       Cheryl  493.0
8   274-80-9391        Straight         Dean  493.0
9   409-56-7008          Bennet      Abraham  493.0
10  427-17-2319            Dull          Ann  493.0
11  472-27-2349      Gringlesby         Burt  493.0
12  648-92-1872  Blotchet-Halls     Reginald  493.0
13  672-71-3249        Yokomoto        Akiko  493.0
14  712-45-1867    del Castillo        Innes  493.0
15  722-51-5454        DeFrance       Michel  493.0
16  756-30-7391          Karsen        Livia  493.0
17  807-91-6654        Panteley       Sylvia  493.0
18  846-92-7186          Hunter       Sheryl  493.0
19  341-22-1782           Smith      Meander    0.0
20  527-72-3246          Greene  Morningstar    0.0
21  724-08-9931        Stringer         Dirk    0.0
22  893-72-1158        McBadden      Heather    0.0

## Bonus Challenge - Most Profiting Authors